module.exports = {

    indent: 4,
    delimiter: ',',
    pathDelimiter: '/',
    locationData: { cities: [], states: [], countries: [] },

    videoMajorBrands: ['mp42', 'qt', 'isom'],
    videoFileTypes: ['mp4', 'mov', 'avi', 'mkv', 'webm', '3gp', 'mts', 'm4v'],

    smartDeviceBrands: [
        'Apple',
        'Samsung',
        'Google',
        'Xiaomi',
        'HUAWEI',
        'Sony',
        'LG',
        'OnePlus',
        'OPPO',
        'vivo',
        'realme',
        'motorola',
        'Nokia',
        'ASUS',
        'Lenovo',
        'HONOR',
        'ZTE',
        'TECNO',
        'Infinix',
        'Nothing'
    ],

    accentReplacements: {
        A: ['A', 'À', 'Á', 'Â', 'Ã', 'Ä', 'Å', 'Ā', 'Ă', 'Ą', 'Ắ', 'Ằ', 'Ặ', 'Ấ', 'Ầ', 'Ậ'],
        a: ['a', 'à', 'á', 'â', 'ã', 'ä', 'å', 'ā', 'ă', 'ą', 'ắ', 'ằ', 'ặ', 'ấ', 'ầ', 'ậ'],

        C: ['C', 'Ç', 'Ć', 'Ĉ', 'Ċ', 'Č'],
        c: ['c', 'ç', 'ć', 'ĉ', 'ċ', 'č'],

        D: ['D', 'Ð', 'Ď', 'Đ'],
        d: ['d', 'ð', 'ď', 'đ'],

        E: ['E', 'È', 'É', 'Ê', 'Ë', 'Ē', 'Ĕ', 'Ė', 'Ę', 'Ě', 'Ế', 'Ề', 'Ệ'],
        e: ['e', 'è', 'é', 'ê', 'ë', 'ē', 'ĕ', 'ė', 'ę', 'ě', 'ế', 'ề', 'ệ'],

        G: ['G', 'Ĝ', 'Ğ', 'Ġ', 'Ģ'],
        g: ['g', 'ĝ', 'ğ', 'ġ', 'ģ'],

        H: ['H', 'Ĥ', 'Ħ'],
        h: ['h', 'ĥ', 'ħ'],

        I: ['I', 'Ì', 'Í', 'Î', 'Ï', 'Ĩ', 'Ī', 'Ĭ', 'Į', 'İ'],
        i: ['i', 'ì', 'í', 'î', 'ï', 'ĩ', 'ī', 'ĭ', 'į', 'ı'],

        J: ['J', 'Ĵ'],
        j: ['j', 'ĵ'],

        K: ['K', 'Ķ'],
        k: ['k', 'ķ'],

        L: ['L', 'Ĺ', 'Ļ', 'Ľ', 'Ŀ', 'Ł'],
        l: ['l', 'ĺ', 'ļ', 'ľ', 'ŀ', 'ł'],

        N: ['N', 'Ñ', 'Ń', 'Ņ', 'Ň'],
        n: ['n', 'ñ', 'ń', 'ņ', 'ň', 'ŉ'],

        O: ['O', 'Ò', 'Ó', 'Ô', 'Õ', 'Ö', 'Ō', 'Ŏ', 'Ő', 'Ø', 'Ố', 'Ồ', 'Ộ', 'Ớ', 'Ờ', 'Ợ'],
        o: ['o', 'ò', 'ó', 'ô', 'õ', 'ö', 'ō', 'ŏ', 'ő', 'ø', 'ố', 'ồ', 'ộ', 'ớ', 'ờ', 'ợ'],

        R: ['R', 'Ŕ', 'Ŗ', 'Ř'],
        r: ['r', 'ŕ', 'ŗ', 'ř'],

        S: ['S', 'Ś', 'Ŝ', 'Ş', 'Š'],
        s: ['s', 'ś', 'ŝ', 'ş', 'š'],

        T: ['T', 'Ţ', 'Ť', 'Ŧ'],
        t: ['t', 'ţ', 'ť', 'ŧ'],

        U: ['U', 'Ù', 'Ú', 'Û', 'Ü', 'Ũ', 'Ū', 'Ŭ', 'Ů', 'Ű', 'Ų', 'Ứ', 'Ừ', 'Ự'],
        u: ['u', 'ù', 'ú', 'û', 'ü', 'ũ', 'ū', 'ŭ', 'ů', 'ű', 'ų', 'ứ', 'ừ', 'ự'],

        W: ['W', 'Ŵ'],
        w: ['w', 'ŵ'],

        Y: ['Y', 'Ý', 'Ŷ', 'Ÿ', 'Ỳ', 'Ỵ'],
        y: ['y', 'ý', 'ÿ', 'ŷ', 'ỳ', 'ỵ'],

        Z: ['Z', 'Ź', 'Ż', 'Ž'],
        z: ['z', 'ź', 'ż', 'ž'],

        AE: ['Æ'],
        ae: ['æ'],

        OE: ['Œ'],
        oe: ['œ']
    }


};
